app/controllers/books_controller.rb

SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books" ORDER BY created_at DESC
---
  def index
    if params[:category].blank?
      @books = Book.all.order("created_at DESC")

SELECT "categories".* FROM "categories"
---
  def new
    @book = current_user.books.build #builds books from current user
    @categories = Category.all.map { |c| [c.name, c.id] }

INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Some book"], ["description", "some desc"], ["author", "Some auth"], ["created_at", "2017-09-28 22:10:30.965900"], ["updated_at", "2017-09-28 22:10:30.965900"], ["user_id", 1]]
---
  def create
    @book = current_user.books.build(book_params)
    @book.category_id = params[:category_id]
    if @book.save

UPDATE "books" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["title", "Game of Thrones Book 1 "], ["description", "GOT man "], ["updated_at", "2017-09-28 20:14:45.398838"], ["id", 1]]
---
  def update
      @book.category_id = params[:category_id]
    if
      @book.update(book_params)